Carter-Liu-Roy/Ti5_TA8T2_Prj/RA8T2_MultiCore_Solution_CPU1/ra/fsp/src/r_ethercat_phy/r_ethercat_phy.c
/*
* Copyright (c) 2020 - 2025 Renesas Electronics Corporation and/or its affiliates
*
* SPDX-License-Identifier: BSD-3-Clause
*/

/***********************************************************************************************************************
 * Includes   <System Includes> , "Project Includes"
 ***********************************************************************************************************************/

/* Access to peripherals and board defines. */
#include "hal_data.h"
#include "r_ethercat_phy.h"

/***********************************************************************************************************************
 * Macro definitions
 ***********************************************************************************************************************/

#ifndef ETHERCAT_PHY_ERROR_RETURN
 #define ETHERCAT_PHY_ERROR_RETURN(a, err)    FSP_ERROR_RETURN((a), (err))
#endif

/** "ECPH" in ASCII.  Used to determine if the control block is open. */
#define ETHERCAT_PHY_OPEN                           (('C' << 24U) | ('P' << 16U) | ('H' << 8U) | ('Y' << 0U))

/* Standard PHY Registers */
#define ETHERCAT_PHY_REG_CONTROL                    (0)
#define ETHERCAT_PHY_REG_STATUS                     (1)
#define ETHERCAT_PHY_REG_IDENTIFIER1                (2)
#define ETHERCAT_PHY_REG_IDENTIFIER2                (3)
#define ETHERCAT_PHY_REG_AN_ADVERTISEMENT           (4)
#define ETHERCAT_PHY_REG_AN_LINK_PARTNER            (5)
#define ETHERCAT_PHY_REG_AN_EXPANSION               (6)
#define ETHERCAT_PHY_REG_GIGABIT_CONTROL            (9)

/* Basic Mode Control Register Bit Definitions */
#define ETHERCAT_PHY_CONTROL_RESET                  (1 << 15)
#define ETHERCAT_PHY_CONTROL_LOOPBACK               (1 << 14)
#define ETHERCAT_PHY_CONTROL_100_MBPS               (1 << 13)
#define ETHERCAT_PHY_CONTROL_AN_ENABLE              (1 << 12)
#define ETHERCAT_PHY_CONTROL_POWER_DOWN             (1 << 11)
#define ETHERCAT_PHY_CONTROL_ISOLATE                (1 << 10)
#define ETHERCAT_PHY_CONTROL_AN_RESTART             (1 << 9)
#define ETHERCAT_PHY_CONTROL_FULL_DUPLEX            (1 << 8)
#define ETHERCAT_PHY_CONTROL_COLLISION              (1 << 7)

/* Basic Mode Status Register Bit Definitions */
#define ETHERCAT_PHY_STATUS_100_T4                  (1 << 15)
#define ETHERCAT_PHY_STATUS_100F                    (1 << 14)
#define ETHERCAT_PHY_STATUS_100H                    (1 << 13)
#define ETHERCAT_PHY_STATUS_10F                     (1 << 12)
#define ETHERCAT_PHY_STATUS_10H                     (1 << 11)
#define ETHERCAT_PHY_STATUS_AN_COMPLETE             (1 << 5)
#define ETHERCAT_PHY_STATUS_RM_FAULT                (1 << 4)
#define ETHERCAT_PHY_STATUS_AN_ABILITY              (1 << 3)
#define ETHERCAT_PHY_STATUS_LINK_UP                 (1 << 2)
#define ETHERCAT_PHY_STATUS_JABBER                  (1 << 1)
#define ETHERCAT_PHY_STATUS_EX_CAPABILITY           (1 << 0)

/* Auto Negotiation Advertisement Bit Definitions */
#define ETHERCAT_PHY_AN_ADVERTISEMENT_NEXT_PAGE     (1 << 15)
#define ETHERCAT_PHY_AN_ADVERTISEMENT_RM_FAULT      (1 << 13)
#define ETHERCAT_PHY_AN_ADVERTISEMENT_ASM_DIR       (1 << 11)
#define ETHERCAT_PHY_AN_ADVERTISEMENT_PAUSE         (1 << 10)
#define ETHERCAT_PHY_AN_ADVERTISEMENT_100_T4        (1 << 9)
#define ETHERCAT_PHY_AN_ADVERTISEMENT_100F          (1 << 8)
#define ETHERCAT_PHY_AN_ADVERTISEMENT_100H          (1 << 7)
#define ETHERCAT_PHY_AN_ADVERTISEMENT_10F           (1 << 6)
#define ETHERCAT_PHY_AN_ADVERTISEMENT_10H           (1 << 5)
#define ETHERCAT_PHY_AN_ADVERTISEMENT_SELECTOR      (1 << 0)

/* Auto Negotiate Link Partner Ability Bit Definitions */
#define ETHERCAT_PHY_AN_LINK_PARTNER_NEXT_PAGE      (1 << 15)
#define ETHERCAT_PHY_AN_LINK_PARTNER_ACK            (1 << 14)
#define ETHERCAT_PHY_AN_LINK_PARTNER_RM_FAULT       (1 << 13)
#define ETHERCAT_PHY_AN_LINK_PARTNER_ASM_DIR        (1 << 11)
#define ETHERCAT_PHY_AN_LINK_PARTNER_PAUSE          (1 << 10)
#define ETHERCAT_PHY_AN_LINK_PARTNER_100_T4         (1 << 9)
#define ETHERCAT_PHY_AN_LINK_PARTNER_100F           (1 << 8)
#define ETHERCAT_PHY_AN_LINK_PARTNER_100H           (1 << 7)
#define ETHERCAT_PHY_AN_LINK_PARTNER_10F            (1 << 6)
#define ETHERCAT_PHY_AN_LINK_PARTNER_10H            (1 << 5)
#define ETHERCAT_PHY_AN_LINK_PARTNER_SELECTOR       (1 << 0)

#define ETHERCAT_PHY_PIR_MDI_MASK                   (1 << 3)
#define ETHERCAT_PHY_PIR_MDO_HIGH                   (0x04)
#define ETHERCAT_PHY_PIR_MDO_LOW                    (0x00)
#define ETHERCAT_PHY_PIR_MMD_WRITE                  (0x02)
#define ETHERCAT_PHY_PIR_MMD_READ                   (0x00)
#define ETHERCAT_PHY_PIR_MDC_HIGH                   (0x01)
#define ETHERCAT_PHY_PIR_MDC_LOW                    (0x00)

/* Gigabit Control Bit Definitions */
#define ETHERCAT_PHY_GIGABIT_CONTROL_1000F          (1 << 9)
#define ETHERCAT_PHY_GIGABIT_CONTROL_1000H          (1 << 8)

#define ETHERCAT_PHY_ADDRESS_SIZE                   (0x1fU)
#define ETHERCAT_PHY_REGISTER_DATA_SIZE             (0xffffU)

#define ETHERCAT_PHY_MII_CONT_STAT_READ_COMMAND     (1)
#define ETHERCAT_PHY_MII_CONT_STAT_WRITE_COMMAND    (2)
#define ETHERCAT_PHY_ERROR_DATA                     (0xffff)

/***********************************************************************************************************************
 * Typedef definitions
 ***********************************************************************************************************************/

/***********************************************************************************************************************
 * Exported global variables (to be accessed by other files)
 ***********************************************************************************************************************/

/***********************************************************************************************************************
 * Exported global function
 ***********************************************************************************************************************/
#if (ETHER_PHY_CFG_TARGET_ICS1894_ENABLE)
extern void ethercat_phy_target_ics1894_initialize(ethercat_phy_instance_ctrl_t * p_instance_ctrl);
extern bool ethercat_phy_target_ics1894_is_support_link_partner_ability(ethercat_phy_instance_ctrl_t * p_instance_ctrl,
                                                                        uint32_t                       line_speed_duplex);

#endif

