Carter-Liu-Roy/Ti5_TA8T2_Prj/RA8T2_MultiCore_Solution_CPU1/ra/fsp/src/r_ethercat_phy/r_ethercat_phy.c
/***********************************************************************************************************************
 * Private global variables and functions
 ***********************************************************************************************************************/
static void ethercat_phy_targets_initialize(ethercat_phy_instance_ctrl_t * p_instance_ctrl);
static bool ethercat_phy_targets_is_support_link_partner_ability(ethercat_phy_instance_ctrl_t * p_instance_ctrl,
                                                                 uint32_t                       line_speed_duplex);
static void ether_phy_write_io(uint32_t phy, uint32_t reg_addr, uint32_t  value);
static uint32_t ether_phy_read_io(uint32_t phy, uint32_t reg_addr);
static uint32_t ether_phy_read_esc(uint32_t phy, uint32_t reg_add);
static void ether_phy_write_esc(uint32_t phy, uint32_t reg_addr, uint32_t data);
static fsp_err_t ether_phy_reset(uint32_t phy);
/** ETHERCAT_PHY HAL API mapping for Ethercat PHY Controller interface */
/*LDRA_INSPECTED 27 D This structure must be accessible in user code. It cannot be static. */
const ether_phy_api_t g_ether_phy_on_ethercat_phy =
{
    .open                  = R_ETHERCAT_PHY_Open,
    .close                 = R_ETHERCAT_PHY_Close,
    .startAutoNegotiate    = R_ETHERCAT_PHY_StartAutoNegotiate,
    .linkPartnerAbilityGet = R_ETHERCAT_PHY_LinkPartnerAbilityGet,
    .linkStatusGet         = R_ETHERCAT_PHY_LinkStatusGet,
    .chipInit              = R_ETHERCAT_PHY_ChipInit,
    .read                  = R_ETHERCAT_PHY_Read,
    .write                 = R_ETHERCAT_PHY_Write
};

/*******************************************************************************************************************//**
 * @addtogroup ETHERCAT_PHY
 * @{
 **********************************************************************************************************************/

/***********************************************************************************************************************
 * Functions
 **********************************************************************************************************************/
uint32_t ether_phy_read(uint32_t phy, uint32_t reg_addr)
{
    return ether_phy_read_io(phy, reg_addr);
}

void ether_phy_write(uint32_t phy, uint32_t reg_addr, uint32_t data)
{
    ether_phy_write_io(phy, reg_addr, data);
}
/********************************************************************************************************************//**
 * @brief Resets Ethercat PHY device. Implements @ref ether_phy_api_t::open.
 *
 * @retval  FSP_SUCCESS                             Channel opened successfully.
 * @retval  FSP_ERR_ASSERTION                       Pointer to ETHERCAT_PHY control block or configuration structure is NULL.
 * @retval  FSP_ERR_ALREADY_OPEN                    Control block has already been opened or channel is being used by another
 *                                                  instance. Call close() then open() to reconfigure.
 * @retval  FSP_ERR_INVALID_CHANNEL                 Invalid channel number is given.
 * @retval  FSP_ERR_INVALID_POINTER                 Pointer to p_cfg is NULL.
 ***********************************************************************************************************************/
fsp_err_t R_ETHERCAT_PHY_Open (ether_phy_ctrl_t * const p_ctrl, ether_phy_cfg_t const * const p_cfg)
{
    fsp_err_t err = FSP_SUCCESS;
    ethercat_phy_instance_ctrl_t * p_instance_ctrl = (ethercat_phy_instance_ctrl_t *) p_ctrl;

#if (ETHERCAT_PHY_CFG_PARAM_CHECKING_ENABLE)
    FSP_ASSERT(p_instance_ctrl);
    ETHERCAT_PHY_ERROR_RETURN(NULL != p_cfg, FSP_ERR_INVALID_POINTER);
    ETHERCAT_PHY_ERROR_RETURN((ETHERCAT_PHY_OPEN != p_instance_ctrl->open), FSP_ERR_ALREADY_OPEN);
    ETHERCAT_PHY_ERROR_RETURN((BSP_FEATURE_ETHER_NUM_CHANNELS > p_cfg->channel), FSP_ERR_INVALID_CHANNEL);
#endif

    /* Initialize configuration of ethernet phy module. */
    p_instance_ctrl->p_ether_phy_cfg = p_cfg;

    p_instance_ctrl->local_advertise = 0;

    /* Configure pins for MII or RMII. Set PHYMODE0 if MII is selected. */
    R_PMISC->PFENET =
        (uint8_t) ((ETHER_PHY_MII_TYPE_MII == p_cfg->mii_type) << (R_PMISC_PFENET_PHYMODE0_Pos + p_cfg->channel));

    p_instance_ctrl->open = ETHERCAT_PHY_OPEN;

    return err;
}                                      /* End of function R_ETHERCAT_PHY_Open() */

/********************************************************************************************************************//**
 * @brief Close Ethercat PHY device. Implements @ref ether_phy_api_t::close.
 *
 * @retval  FSP_SUCCESS                                 Channel successfully closed.
 * @retval  FSP_ERR_ASSERTION                           Pointer to ETHERCAT_PHY control block is NULL.
 * @retval  FSP_ERR_NOT_OPEN                            The control block has not been opened
 *
 ***********************************************************************************************************************/
fsp_err_t R_ETHERCAT_PHY_Close (ether_phy_ctrl_t * const p_ctrl)
{
    fsp_err_t err = FSP_SUCCESS;
    ethercat_phy_instance_ctrl_t * p_instance_ctrl = (ethercat_phy_instance_ctrl_t *) p_ctrl;

#if (ETHERCAT_PHY_CFG_PARAM_CHECKING_ENABLE)
    FSP_ASSERT(p_instance_ctrl);
    ETHERCAT_PHY_ERROR_RETURN(ETHERCAT_PHY_OPEN == p_instance_ctrl->open, FSP_ERR_NOT_OPEN);
#endif

    /** Clear configure block parameters. */
    p_instance_ctrl->p_ether_phy_cfg  = NULL;
    p_instance_ctrl->local_advertise  = 0;
    p_instance_ctrl->interface_status = ETHERCAT_PHY_INTERFACE_STATUS_UNINITIALIZED;
    p_instance_ctrl->open             = 0;

    return err;
}                                      /* End of function R_ETHERCAT_PHY_Close() */

/********************************************************************************************************************//**
 * @brief Starts auto-negotiate. Implements @ref ether_phy_api_t::startAutoNegotiate.
 *
 * @retval  FSP_SUCCESS                                 ETHERCAT_PHY successfully starts auto-negotiate.
 * @retval  FSP_ERR_ASSERTION                           Pointer to ETHERCAT_PHY control block is NULL.
 * @retval  FSP_ERR_NOT_OPEN                            The control block has not been opened
 * @retval  FSP_ERR_INVALID_ARGUMENT                    Register address is incorrect
 * @retval  FSP_ERR_INVALID_MODE                        Command is invalid.
 * @retval  FSP_ERR_INVALID_POINTER                     Pointer to read buffer is NULL.
 * @retval  FSP_ERR_NOT_INITIALIZED                     The control block has not been initialized
 ***********************************************************************************************************************/
fsp_err_t R_ETHERCAT_PHY_StartAutoNegotiate (ether_phy_ctrl_t * const p_ctrl)
{
    ethercat_phy_instance_ctrl_t * p_instance_ctrl = (ethercat_phy_instance_ctrl_t *) p_ctrl;
    uint32_t reg = 0;

#if (ETHERCAT_PHY_CFG_PARAM_CHECKING_ENABLE)
    FSP_ASSERT(p_instance_ctrl);
    ETHERCAT_PHY_ERROR_RETURN(ETHERCAT_PHY_OPEN == p_instance_ctrl->open, FSP_ERR_NOT_OPEN);
    ETHERCAT_PHY_ERROR_RETURN(ETHERCAT_PHY_INTERFACE_STATUS_INITIALIZED == p_instance_ctrl->interface_status,
                              FSP_ERR_NOT_INITIALIZED);
#endif

    /* Set local ability */
    /* When pause frame is not used */
    if (ETHER_PHY_FLOW_CONTROL_DISABLE == p_instance_ctrl->p_ether_phy_cfg->flow_control)
    {
        p_instance_ctrl->local_advertise = ((((ETHERCAT_PHY_AN_ADVERTISEMENT_100F |
                                               ETHERCAT_PHY_AN_ADVERTISEMENT_100H) |
                                              ETHERCAT_PHY_AN_ADVERTISEMENT_10F) |
                                             ETHERCAT_PHY_AN_ADVERTISEMENT_10H) |
                                            ETHERCAT_PHY_AN_ADVERTISEMENT_SELECTOR);
    }
    /* When pause frame is used */
    else
    {
        p_instance_ctrl->local_advertise = ((((((ETHERCAT_PHY_AN_ADVERTISEMENT_ASM_DIR |
                                                 ETHERCAT_PHY_AN_ADVERTISEMENT_PAUSE) |
                                                ETHERCAT_PHY_AN_ADVERTISEMENT_100F) |
                                               ETHERCAT_PHY_AN_ADVERTISEMENT_100H) |
                                              ETHERCAT_PHY_AN_ADVERTISEMENT_10F) |
                                             ETHERCAT_PHY_AN_ADVERTISEMENT_10H) |
                                            ETHERCAT_PHY_AN_ADVERTISEMENT_SELECTOR);
    }

    /* Configure what the PHY and the Ethernet controller on this board supports */
    R_ETHERCAT_PHY_Write(p_instance_ctrl, ETHERCAT_PHY_REG_AN_ADVERTISEMENT, p_instance_ctrl->local_advertise);

