Carter-Liu-Roy/Ti5_TA8T2_Prj/RA8T2_MultiCore_Solution_CPU1/ra/fsp/src/r_ethercat_phy/r_ethercat_phy.c
    /* Advertise Gigabit Ethernet capacity when using RGMII or GMII. */
    if ((ETHER_PHY_MII_TYPE_RGMII == p_instance_ctrl->p_ether_phy_cfg->mii_type) ||
        (ETHER_PHY_MII_TYPE_GMII == p_instance_ctrl->p_ether_phy_cfg->mii_type))
    {
        R_ETHERCAT_PHY_Write(p_instance_ctrl, ETHERCAT_PHY_REG_GIGABIT_CONTROL,
                             (ETHERCAT_PHY_GIGABIT_CONTROL_1000F | ETHERCAT_PHY_GIGABIT_CONTROL_1000H));
    }

    /* Start auto-negotiation. */
    R_ETHERCAT_PHY_Write(p_instance_ctrl,
                         ETHERCAT_PHY_REG_CONTROL,
                         (ETHERCAT_PHY_CONTROL_AN_ENABLE |
                          ETHERCAT_PHY_CONTROL_AN_RESTART));

    R_ETHERCAT_PHY_Read(p_instance_ctrl, ETHERCAT_PHY_REG_AN_ADVERTISEMENT, &reg);

    return FSP_SUCCESS;
}                                      /* End of function R_ETHERCAT_PHY_StartAutoNegotiate() */

/********************************************************************************************************************//**
 * @brief Reports the other side's physical capability. Implements @ref ether_phy_api_t::linkPartnerAbilityGet.
 *
 * @retval  FSP_SUCCESS                                 ETHERCAT_PHY successfully get link partner ability.
 * @retval  FSP_ERR_ASSERTION                           Pointer to ETHERCAT_PHY control block is NULL.
 * @retval  FSP_ERR_INVALID_POINTER                     Pointer to arguments are NULL.
 * @retval  FSP_ERR_NOT_OPEN                            The control block has not been opened
 * @retval  FSP_ERR_ETHER_PHY_ERROR_LINK                PHY-LSI is not link up.
 * @retval  FSP_ERR_ETHER_PHY_NOT_READY                 The auto-negotiation isn't completed
 * @retval  FSP_ERR_INVALID_ARGUMENT                    Status register address is incorrect
 * @retval  FSP_ERR_INVALID_MODE                        Command is invalid.
 * @retval  FSP_ERR_NOT_INITIALIZED                     The control block has not been initialized
 ***********************************************************************************************************************/
fsp_err_t R_ETHERCAT_PHY_LinkPartnerAbilityGet (ether_phy_ctrl_t * const p_ctrl,
                                                uint32_t * const         p_line_speed_duplex,
                                                uint32_t * const         p_local_pause,
                                                uint32_t * const         p_partner_pause)
{
    fsp_err_t err = FSP_SUCCESS;
    ethercat_phy_instance_ctrl_t * p_instance_ctrl = (ethercat_phy_instance_ctrl_t *) p_ctrl;
    uint32_t reg               = 0;
    uint32_t line_speed_duplex = ETHER_PHY_LINK_SPEED_NO_LINK;

#if (ETHERCAT_PHY_CFG_PARAM_CHECKING_ENABLE)
    FSP_ASSERT(p_instance_ctrl);
    ETHERCAT_PHY_ERROR_RETURN(ETHERCAT_PHY_OPEN == p_instance_ctrl->open, FSP_ERR_NOT_OPEN);
    ETHERCAT_PHY_ERROR_RETURN(NULL != p_line_speed_duplex, FSP_ERR_INVALID_POINTER);
    ETHERCAT_PHY_ERROR_RETURN(NULL != p_local_pause, FSP_ERR_INVALID_POINTER);
    ETHERCAT_PHY_ERROR_RETURN(NULL != p_partner_pause, FSP_ERR_INVALID_POINTER);
    ETHERCAT_PHY_ERROR_RETURN(ETHERCAT_PHY_INTERFACE_STATUS_INITIALIZED == p_instance_ctrl->interface_status,
                              FSP_ERR_NOT_INITIALIZED);
#endif

    /* Because reading the first time shows the previous state, the Link status bit is read twice. */
    R_ETHERCAT_PHY_Read(p_instance_ctrl, ETHERCAT_PHY_REG_STATUS, &reg);
    R_ETHERCAT_PHY_Read(p_instance_ctrl, ETHERCAT_PHY_REG_STATUS, &reg);

    /* When the link isn't up, return error */
    ETHERCAT_PHY_ERROR_RETURN(ETHERCAT_PHY_STATUS_LINK_UP == (reg & ETHERCAT_PHY_STATUS_LINK_UP),
                              FSP_ERR_ETHER_PHY_ERROR_LINK);

    /* Establish local pause capability */
    if (ETHERCAT_PHY_AN_ADVERTISEMENT_PAUSE == (p_instance_ctrl->local_advertise & ETHERCAT_PHY_AN_ADVERTISEMENT_PAUSE))
    {
        (*p_local_pause) |= (1 << 1);
    }

    if (ETHERCAT_PHY_AN_ADVERTISEMENT_ASM_DIR ==
        (p_instance_ctrl->local_advertise & ETHERCAT_PHY_AN_ADVERTISEMENT_ASM_DIR))
    {
        (*p_local_pause) |= 1;
    }

    /* When the auto-negotiation isn't completed, return error */
    ETHERCAT_PHY_ERROR_RETURN(ETHERCAT_PHY_STATUS_AN_COMPLETE == (reg & ETHERCAT_PHY_STATUS_AN_COMPLETE),
                              FSP_ERR_ETHER_PHY_NOT_READY);

    /* Get the link partner response */
    R_ETHERCAT_PHY_Read(p_instance_ctrl, ETHERCAT_PHY_REG_AN_LINK_PARTNER, &reg);

    /* Establish partner pause capability */
    if (ETHERCAT_PHY_AN_LINK_PARTNER_PAUSE == (reg & ETHERCAT_PHY_AN_LINK_PARTNER_PAUSE))
    {
        (*p_partner_pause) = (1 << 1);
    }

    if (ETHERCAT_PHY_AN_LINK_PARTNER_ASM_DIR == (reg & ETHERCAT_PHY_AN_LINK_PARTNER_ASM_DIR))
    {
        (*p_partner_pause) |= 1;
    }

    /* Establish the line speed and the duplex */
    if ((ETHERCAT_PHY_AN_LINK_PARTNER_10H == (reg & ETHERCAT_PHY_AN_LINK_PARTNER_10H)) &&
        ethercat_phy_targets_is_support_link_partner_ability(p_instance_ctrl, ETHER_PHY_LINK_SPEED_10H))
    {
        line_speed_duplex = ETHER_PHY_LINK_SPEED_10H;
    }

    if ((ETHERCAT_PHY_AN_LINK_PARTNER_10F == (reg & ETHERCAT_PHY_AN_LINK_PARTNER_10F)) &&
        ethercat_phy_targets_is_support_link_partner_ability(p_instance_ctrl, ETHER_PHY_LINK_SPEED_10F))
    {
        line_speed_duplex = ETHER_PHY_LINK_SPEED_10F;
    }

    if ((ETHERCAT_PHY_AN_LINK_PARTNER_100H == (reg & ETHERCAT_PHY_AN_LINK_PARTNER_100H)) &&
        ethercat_phy_targets_is_support_link_partner_ability(p_instance_ctrl, ETHER_PHY_LINK_SPEED_100H))
    {
        line_speed_duplex = ETHER_PHY_LINK_SPEED_100H;
    }

    if ((ETHERCAT_PHY_AN_LINK_PARTNER_100F == (reg & ETHERCAT_PHY_AN_LINK_PARTNER_100F)) &&
        ethercat_phy_targets_is_support_link_partner_ability(p_instance_ctrl, ETHER_PHY_LINK_SPEED_100F))
    {
        line_speed_duplex = ETHER_PHY_LINK_SPEED_100F;
    }

    /* When MII type is RGMII, check also Gigabit Ethernet ability. */
    if ((ETHER_PHY_MII_TYPE_RGMII == p_instance_ctrl->p_ether_phy_cfg->mii_type) ||
        (ETHER_PHY_MII_TYPE_GMII == p_instance_ctrl->p_ether_phy_cfg->mii_type))
    {
        R_ETHERCAT_PHY_Read(p_instance_ctrl, ETHERCAT_PHY_REG_GIGABIT_CONTROL, &reg);

        if ((ETHERCAT_PHY_GIGABIT_CONTROL_1000H == (reg & ETHERCAT_PHY_GIGABIT_CONTROL_1000H)) &&
            ethercat_phy_targets_is_support_link_partner_ability(p_instance_ctrl, ETHER_PHY_LINK_SPEED_1000H))
        {
            line_speed_duplex = ETHER_PHY_LINK_SPEED_1000H;
        }

        if ((ETHERCAT_PHY_GIGABIT_CONTROL_1000F == (reg & ETHERCAT_PHY_GIGABIT_CONTROL_1000F)) &&
            ethercat_phy_targets_is_support_link_partner_ability(p_instance_ctrl, ETHER_PHY_LINK_SPEED_1000F))
        {
            line_speed_duplex = ETHER_PHY_LINK_SPEED_1000F;
        }
    }

    if (ETHER_PHY_LINK_SPEED_NO_LINK == line_speed_duplex)
    {
        err = FSP_ERR_ETHER_PHY_ERROR_LINK;
    }
    else
    {
        (*p_line_speed_duplex) = line_speed_duplex;
    }

