Carter-Liu-Roy/Ti5_TA8T2_Prj/RA8T2_MultiCore_Solution_CPU1/ra/fsp/src/r_ethercat_phy/r_ethercat_phy.c
    return err;
}                                      /* End of function R_ETHERCAT_PHY_LinkPartnerAbilityGet() */

/********************************************************************************************************************//**
 * @brief Returns the status of the physical link. Implements @ref ether_phy_api_t::linkStatusGet.
 *
 * @retval  FSP_SUCCESS                                 ETHERCAT_PHY successfully get link partner ability.
 * @retval  FSP_ERR_ASSERTION                           Pointer to ETHERCAT_PHY control block is NULL.
 * @retval  FSP_ERR_NOT_OPEN                            The control block has not been opened
 * @retval  FSP_ERR_ETHER_PHY_ERROR_LINK                PHY-LSI is not link up.
 * @retval  FSP_ERR_INVALID_ARGUMENT                    Status register address is incorrect
 * @retval  FSP_ERR_INVALID_MODE                        Command is invalid.
 * @retval  FSP_ERR_INVALID_POINTER                     Pointer to read buffer is NULL.
 * @retval  FSP_ERR_NOT_INITIALIZED                     The control block has not been initialized
 ***********************************************************************************************************************/
fsp_err_t R_ETHERCAT_PHY_LinkStatusGet (ether_phy_ctrl_t * const p_ctrl)
{
    ethercat_phy_instance_ctrl_t * p_instance_ctrl = (ethercat_phy_instance_ctrl_t *) p_ctrl;
    uint32_t  reg = 0;
    fsp_err_t err = FSP_SUCCESS;

#if (ETHERCAT_PHY_CFG_PARAM_CHECKING_ENABLE)
    FSP_ASSERT(p_instance_ctrl);
    ETHERCAT_PHY_ERROR_RETURN(ETHERCAT_PHY_OPEN == p_instance_ctrl->open, FSP_ERR_NOT_OPEN);
    ETHERCAT_PHY_ERROR_RETURN(ETHERCAT_PHY_INTERFACE_STATUS_INITIALIZED == p_instance_ctrl->interface_status,
                              FSP_ERR_NOT_INITIALIZED);
#endif

    /* Because reading the first time shows the previous state, the Link status bit is read twice. */
    R_ETHERCAT_PHY_Read(p_instance_ctrl, ETHERCAT_PHY_REG_STATUS, &reg);
    R_ETHERCAT_PHY_Read(p_instance_ctrl, ETHERCAT_PHY_REG_STATUS, &reg);

    /* When the link isn't up, return error */
    if (ETHERCAT_PHY_STATUS_LINK_UP != (reg & ETHERCAT_PHY_STATUS_LINK_UP))
    {
        /* Link is down */
        err = FSP_ERR_ETHER_PHY_ERROR_LINK;
    }
    else
    {
        /* Link is up */
        err = FSP_SUCCESS;
    }

    return err;
}                                      /* End of function R_ETHERCAT_PHY_LinkStatusGet() */

/********************************************************************************************************************//**
 * @brief Initialize Ethercat PHY device. Implements @ref ether_phy_api_t::chipInit.
 *
 * @retval  FSP_SUCCESS                             PHY device initialized successfully.
 * @retval  FSP_ERR_ASSERTION                       Pointer to ETHERCAT_PHY control block or configuration structure is NULL.
 * @retval  FSP_ERR_INVALID_POINTER                 Pointer to p_cfg is NULL.
 * @retval  FSP_ERR_NOT_OPEN                        The control block has not been opened.
 * @retval  FSP_ERR_TIMEOUT                         PHY-LSI Reset wait timeout.
 ***********************************************************************************************************************/
fsp_err_t R_ETHERCAT_PHY_ChipInit (ether_phy_ctrl_t * const p_ctrl, ether_phy_cfg_t const * const p_cfg)
{
    fsp_err_t err = FSP_SUCCESS;
    ethercat_phy_instance_ctrl_t * p_instance_ctrl = (ethercat_phy_instance_ctrl_t *) p_ctrl;
    uint32_t count = 0;

#if (ETHERCAT_PHY_CFG_PARAM_CHECKING_ENABLE)
    FSP_ASSERT(p_instance_ctrl);
    ETHERCAT_PHY_ERROR_RETURN(NULL != p_cfg, FSP_ERR_INVALID_POINTER);
    ETHERCAT_PHY_ERROR_RETURN(ETHERCAT_PHY_OPEN == p_instance_ctrl->open, FSP_ERR_NOT_OPEN);
#endif

    p_instance_ctrl->interface_status = ETHERCAT_PHY_INTERFACE_STATUS_INITIALIZED;

    if (count < p_cfg->phy_reset_wait_time)
    {
        ethercat_phy_targets_initialize(p_instance_ctrl);
    }
    else
    {
        err = FSP_ERR_TIMEOUT;
    }

    return err;
}                                      /* End of function R_ETHERCAT_PHY_ChipInit() */

/********************************************************************************************************************//**
 * @brief Read data from register of PHY-LSI . Implements @ref ether_phy_api_t::read.
 *
 * @retval  FSP_SUCCESS                                 ETHERCAT_PHY successfully read data.
 * @retval  FSP_ERR_ASSERTION                           Pointer to ETHERCAT_PHY control block is NULL.
 * @retval  FSP_ERR_INVALID_POINTER                     Pointer to read buffer is NULL.
 * @retval  FSP_ERR_INVALID_ARGUMENT                    Address is not a valid size
 * @retval  FSP_ERR_INVALID_MODE                        Command is invalid.
 * @retval  FSP_ERR_NOT_INITIALIZED                     The control block has not been initialized
 ***********************************************************************************************************************/
fsp_err_t R_ETHERCAT_PHY_Read (ether_phy_ctrl_t * const p_ctrl, uint32_t reg_addr, uint32_t * const p_data)
{
    ethercat_phy_instance_ctrl_t * p_instance_ctrl = (ethercat_phy_instance_ctrl_t *) p_ctrl;
    fsp_err_t    err       = FSP_SUCCESS;
    R_ESC_Type * p_reg_esc = (R_ESC_Type *) R_ESC_BASE;

     *p_data = ether_phy_read_io(p_instance_ctrl->p_ether_phy_cfg->channel, reg_addr );
//    {
//        *p_data = ETHERCAT_PHY_ERROR_DATA;
//    }

    return err;
}                                      /* End of function R_ETHERCAT_PHY_Read() */

/********************************************************************************************************************//**
 * @brief Write data to register of PHY-LSI . Implements @ref ether_phy_api_t::write.
 *
 * @retval  FSP_SUCCESS                                 ETHERCAT_PHY successfully write data.
 * @retval  FSP_ERR_ASSERTION                           Pointer to ETHERCAT_PHY control block is NULL.
 * @retval  FSP_ERR_INVALID_ARGUMENT                    Address or data is not a valid size
 * @retval  FSP_ERR_INVALID_MODE                        Command is invalid.
 * @retval  FSP_ERR_NOT_INITIALIZED                     The control block has not been initialized
 ***********************************************************************************************************************/
fsp_err_t R_ETHERCAT_PHY_Write (ether_phy_ctrl_t * const p_ctrl, uint32_t reg_addr, uint32_t data)
{
    ethercat_phy_instance_ctrl_t * p_instance_ctrl = (ethercat_phy_instance_ctrl_t *) p_ctrl;
    fsp_err_t    err       = FSP_SUCCESS;
    R_ESC_Type * p_reg_esc = (R_ESC_Type *) R_ESC_BASE;

    ether_phy_write_io(p_instance_ctrl->p_ether_phy_cfg->channel, reg_addr, data );

