Carter-Liu-Roy/Ti5_TA8T2_Prj/RA8T2_MultiCore_Solution_CPU1/ra/fsp/src/r_ethercat_phy/r_ethercat_phy.c
    return err;
}

/* End of function R_ETHERCAT_PHY_Write() */

/*******************************************************************************************************************//**
 * @} (end addtogroup ETHERCAT_PHY)
 **********************************************************************************************************************/

/**
 * Private functions
 */

/***********************************************************************************************************************
 * Function Name: ethercat_phy_targets_initialize
 * Description  : PHY-LSI specific initialization processing
 * Arguments    : p_instance_ctrl -
 *                    Ethercat control block
 * Return Value : none
 ***********************************************************************************************************************/
static void ethercat_phy_targets_initialize (ethercat_phy_instance_ctrl_t * p_instance_ctrl)
{
    switch (p_instance_ctrl->p_ether_phy_cfg->phy_lsi_type)
    {
        /* Use ICS1894 */
#if (ETHER_PHY_CFG_TARGET_ICS1894_ENABLE)
        case ETHER_PHY_LSI_TYPE_ICS1894:
        {
            ethercat_phy_target_ics1894_initialize(p_instance_ctrl);
            break;
        }
#endif

        /* User custom */
#if (ETHER_PHY_CFG_USE_CUSTOM_PHY_LSI_ENABLE)
        case ETHER_PHY_LSI_TYPE_CUSTOM:
        {
            if (NULL != p_instance_ctrl->p_ether_phy_cfg->p_extend)
            {
                ether_phy_extended_cfg_t const * p_callback = p_instance_ctrl->p_ether_phy_cfg->p_extend;
                if (NULL != p_callback->p_target_init)
                {
                    p_callback->p_target_init(p_instance_ctrl);
                }
            }

            break;
        }
#endif

        /* If module is configured for default LSI */
        default:
        {
            break;
        }
    }
}                                      /* End of function ethercat_phy_targets_initialize() */

/***********************************************************************************************************************
 * Function Name: ethercat_phy_targets_is_support_link_partner_ability
 * Description  : Check if the PHY-LSI connected Ethercat controller supports link ability
 * Arguments    : p_instance_ctrl -
 *                    Ethercat control block
 *                line_speed_duplex -
 *                    Line speed duplex of link partner PHY-LSI
 * Return Value : bool
 ***********************************************************************************************************************/
static bool ethercat_phy_targets_is_support_link_partner_ability (ethercat_phy_instance_ctrl_t * p_instance_ctrl,
                                                                  uint32_t                       line_speed_duplex)
{
    bool result = false;
    FSP_PARAMETER_NOT_USED(line_speed_duplex);

    switch (p_instance_ctrl->p_ether_phy_cfg->phy_lsi_type)
    {
        /* Use ICS1894 */
#if (ETHER_PHY_CFG_TARGET_ICS1894_ENABLE)
        case ETHER_PHY_LSI_TYPE_ICS1894:
        {
            result = ethercat_phy_target_ics1894_is_support_link_partner_ability(p_instance_ctrl, line_speed_duplex);
            break;
        }
#endif

        /* User custom */
#if (ETHER_PHY_CFG_USE_CUSTOM_PHY_LSI_ENABLE)
        case ETHER_PHY_LSI_TYPE_CUSTOM:
        {
            if (NULL != p_instance_ctrl->p_ether_phy_cfg->p_extend)
            {
                ether_phy_extended_cfg_t const * p_callback = p_instance_ctrl->p_ether_phy_cfg->p_extend;
                if (NULL != p_callback->p_target_link_partner_ability_get)
                {
                    result = p_callback->p_target_link_partner_ability_get(p_instance_ctrl, line_speed_duplex);
                }
            }

            break;
        }
#endif

        /* If module is configured for default LSI, always return true */
        default:
        {
            result = true;
            break;
        }
    }

    return result;
}                                      /* End of function ethercat_phy_targets_is_support_link_partner_ability() */
///////////////////////////////////////////////////////////////////////////////////////
// PHY operation by GPIO    ////////////////////
#define PIN_CFG_OUTL                IOPORT_CFG_PORT_DIRECTION_OUTPUT| IOPORT_CFG_PORT_OUTPUT_LOW
#define PIN_CFG_OUTH                IOPORT_CFG_PORT_DIRECTION_OUTPUT| IOPORT_CFG_PORT_OUTPUT_HIGH
#define PIN_CFG_IN                  IOPORT_CFG_PORT_DIRECTION_INPUT
#define PIN_CFG_PERI                IOPORT_CFG_PERIPHERAL_PIN | IOPORT_PERIPHERAL_ESC

#define MDIO_DATA                   BSP_IO_PORT_07_PIN_09
#define MDIO_CLOCK                  BSP_IO_PORT_07_PIN_08
#define mdio_delay()                R_BSP_SoftwareDelay(1, BSP_DELAY_UNITS_MICROSECONDS)


#define gpio_set_out(pin)           R_IOPORT_PinCfg(NULL, pin, PIN_CFG_OUTL)
#define gpio_set_in(pin)            R_IOPORT_PinCfg(NULL, pin, PIN_CFG_IN)


//#define mdio_out(d)                 R_BSP_PinWrite(MDIO_DATA, d);   \
//		                            mdio_delay();                   \
//		                            R_BSP_PinWrite(MDIO_CLOCK, 1);  \
//		                            mdio_delay();                   \
//		                            R_BSP_PinWrite(MDIO_CLOCK, 0);  \
//		                            mdio_delay()
void mdio_out(uint32_t d)
{
    R_IOPORT_PinWrite(NULL, MDIO_DATA, d);
    mdio_delay();
    R_IOPORT_PinWrite(NULL, MDIO_CLOCK, 1);
    mdio_delay();
    R_IOPORT_PinWrite(NULL, MDIO_CLOCK, 0);
//    mdio_delay();
}

void mdio_in(uint32_t* val)
{
    *val = R_BSP_PinRead(MDIO_DATA);
    R_IOPORT_PinWrite(NULL, MDIO_CLOCK, 1);
    mdio_delay();
    R_IOPORT_PinWrite(NULL, MDIO_CLOCK, 0);
    mdio_delay();
}

void mdio_init()
{
    R_IOPORT_PinCfg(NULL, MDIO_CLOCK, PIN_CFG_OUTL);
    R_IOPORT_PinCfg(NULL, MDIO_DATA, PIN_CFG_OUTH);
    mdio_delay();
}

void mdio_end()
{
    mdio_delay();
    R_IOPORT_PinWrite(NULL, MDIO_CLOCK, 0);
    R_IOPORT_PinWrite(NULL, MDIO_DATA, 1);
    R_IOPORT_PinCfg(NULL, MDIO_CLOCK, PIN_CFG_PERI);
    R_IOPORT_PinCfg(NULL, MDIO_DATA, PIN_CFG_PERI);
}

static void ether_phy_write_io(uint32_t phy, uint32_t reg_addr, uint32_t  value)
{
    mdio_init();

    // MDIO?????
    // ?? preamble 32bit 1
    for (int i = 0; i < 32; i++) {
        mdio_out(1);
    }

    // ?? start code: 01
    mdio_out(0);
    mdio_out(1);

    // ?? OP code (01 for write)
    mdio_out(0);
    mdio_out(1);

    // ?? PHY address: 5bit
    for (int i = 0; i < 5; i++) {
        mdio_out((phy << i) & 0x0010);
    }

    // ?? REG address: 5bit
    for (int i = 0; i < 5; i++) {
        mdio_out( (reg_addr << i) & 0x0010);
    }

    // ?? turnaround (TA) bit: 10
    mdio_out(1);
    mdio_out(0);

    // ?? data: 16bit
    for (int i = 0; i < 16; i++) {
        mdio_out( ((value << i) & 0x8000)== 0x8000);
    }

    // ??????????????
    mdio_end();
}


static uint32_t ether_phy_read_io(uint32_t phy, uint32_t reg_addr)
{
    uint32_t reg = 0;
    uint32_t b = 0;

    mdio_init();

    // MDIO?????
    // ?? preamble 32bit 1
    for (int i = 0; i < 32; i++) {
        mdio_out(1);
    }

    // ?? start code: 01
    mdio_out(0);
    mdio_out(1);

    // ?? OP code (10 for read)
    mdio_out(1);
    mdio_out(0);

    // ?? PHY address: 5bit
    for (int i = 0; i < 5; i++) {
        mdio_out((phy << i) & 0x0010);
    }

    // ?? REG address: 5bit
    for (int i = 0; i < 5; i++) {
        mdio_out((reg_addr << i) & 0x0010);
    }

    // ?? turnaround (TA) bit: 10
    mdio_out(1);
    mdio_out(0);

    // ??????????(??????)
    gpio_set_in(MDIO_DATA);

    // ?? data
    for (int i = 0; i < 16; i++) {
        mdio_in(&b);
        b <<= (15-i);
        reg |= b;
    }

    // ??????????(??????)
//    gpio_set_out(MDIO_DATA);

    // ??????????????
    mdio_end();

    return reg;
}
